import streamlit as st
import requests

st.title("🚗 교통사고 위험 예측 서비스")

st.write("위치와 정보를 입력하면 사고 위험도를 예측합니다.")

# ------------------------
# 입력 UI
# ------------------------

weekday = st.selectbox("요일", ["월요일","화요일","수요일","목요일","금요일","토요일","일요일"])
발생지시도 = st.text_input("시도", "서울")
사고유형 = st.text_input("사고유형", "차대사람")
도로형태 = st.text_input("도로형태", "단일로")
가해자 = st.text_input("가해자", "승용차")
피해자 = st.text_input("피해자", "보행자")
주야 = st.selectbox("주야", ["주","야"])

발생년 = st.number_input("발생년", value=2023)
발생월 = st.number_input("발생월", value=5)
발생일 = st.number_input("발생일", value=12)
발생시 = st.number_input("발생시", value=14)

위도 = st.number_input("위도", value=37.4979)
경도 = st.number_input("경도", value=127.0276)

사상자수 = st.number_input("사상자수", value=0.3)

# ------------------------
# 버튼
# ------------------------

if st.button("예측하기 🚀"):

    url = "http://127.0.0.1:8000/predict"

    payload = {
        "요일": weekday,
        "발생지시도": 발생지시도,
        "사고유형_대분류": 사고유형,
        "도로형태_대분류": 도로형태,
        "가해자_당사자종별": 가해자,
        "피해자_당사자종별": 피해자,
        "주야": 주야,
        "발생년": 발생년,
        "발생월": 발생월,
        "발생일": 발생일,
        "발생시": 발생시,
        "경도": 경도,
        "위도": 위도,
        "사상자수": 사상자수
    }

    try:
        response = requests.post(url, json=payload)

        if response.status_code == 200:
            result = response.json()
            st.success(f"🚨 예측 사고 건수: {result['predicted_반경500m사고건수']:.2f}")

            st.write("📊 주변 환경")
            st.json(result["used_features"])
        else:
            st.error("API 오류 발생")

    except Exception as e:
        st.error(f"서버 연결 실패: {e}")